AccumulationRegisters/ТоварыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыОрганизаций</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюСписания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоРНПТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КОформлениюСписанияПоРНПТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>23</v8:Digits>
							<v8:FractionDigits>11</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорАналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияОтгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннееПотреблениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.МаркировкаТоваровГИСМ</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаТоваровМеждуОрганизациями</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиРасходов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаРасходов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаАктивовПассивов</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетПартий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Первичное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПартияПроизводства</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборкаТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗапасов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЗапасов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыКОтбору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыКОтбору</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КОтбору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отбирается</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отобрано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РасходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаВнутреннееПотребление</v8:Type>
						<v8:Type>cfg:DocumentRef.ОрдерНаПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварноеМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/УпаковочныйЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>УпаковочныйЛист</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КР_КоробаНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладУпаковки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУпаковочныхЛистов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимПросмотраПоТоварам</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Партнер</Name>
					<Comment>Поставщик, от которого поступил короб</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ДокументОснование</Name>
					<Comment>Документ поступления короба с товаром</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПеремещение</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_ТипНаполнения</Name>
					<Comment>Тип наполнения короба</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КР_ТипНаполненияКоробов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КР_Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>21</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>злНомерОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛист</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураПартнера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоУпаковочныйЛист</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСлужебнаяСтрокаПустогоУпаковочногоЛиста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УпаковочныйЛистРодитель</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УпаковочныйЛист</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/КР_ДополнительныеНастройкиПовтИсп/Ext/Module.bsl
///////////////////////////////////////////////////
//// Общий модуль "КР_ОбщегоНазначениеПовтИсп"
//// Создан: 23.08.2022,  Мельников А.А.,  КРОК,  Jira№ A2105505-384

#Область ПрограммныйИнтерфейс   

// << 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723
// Возвращает значение доп. настройки, приведенное к типу
//
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента доп.настройки
//  ПроверятьЗаполнение - Булево - Проверять заполнение доп.настройки. Если не заполнено, вызывается исключение
//		По умолчанию = Истина
// 
// Возвращаемое значение:
//  Произвольное - значение настройки, приведенное к его типу, определенному для ввода
//
Функция Значение(ИмяПредопределенного, ПроверятьЗаполнение = Истина) Экспорт 
	
	ДополнительныеНастройкиСистемы = Справочники.КР_ДополнительныеНастройкиСистемы;
	СтруктураНастройки = 
		ДополнительныеНастройкиСистемы.ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяПредопределенного); 
		
	Если СтруктураНастройки = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'Для %1 не определены настройки ограничения полей ввода'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступноЗначение Тогда 
		ТекстСообщения = НСтр("ru = 'Для %1 недоступно получение значения'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
		
	ОграничениеТипа = СтруктураНастройки.СтруктураСвойствЗначения.ОграничениеТипа;
	
	Значение = ДополнительныеНастройкиСистемы[ИмяПредопределенного].Значение;
	Значение = ОграничениеТипа.ПривестиЗначение(Значение);  

	Если Не ПроверятьЗаполнение
		Или ЗначениеЗаполнено(Значение)
		Или ТипЗнч(Значение) = Тип("Булево") Тогда 
		Возврат Значение;
	КонецЕсли;	    
	
	ТекстСообщения = НСтр("ru = 'Не заполнено значение дополнительной настройки %1'"); 
	ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
	ВызватьИсключение ТекстСообщения;
	
КонецФункции // >> 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723

// << 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723
// Возвращает массив значений доп. настройки, приведенных к типу
//
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента доп.настройки
//  ПроверятьЗаполнение - Булево - Проверять заполнение доп.настройки. Проверяется как каждый элемент так массив на наличие элементов.
//		Если не заполнено, вызывается исключение
//		По умолчанию = Истина
// 
// Возвращаемое значение:
//  Массив - массив значений настройки, приведенных к его типу, определенному для ввода
//
Функция МассивЗначений(ИмяПредопределенного, ПроверятьЗаполнение = Истина) Экспорт 
	
	ДополнительныеНастройкиСистемы = Справочники.КР_ДополнительныеНастройкиСистемы;
	СтруктураНастройки = 
		ДополнительныеНастройкиСистемы.ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяПредопределенного); 
		
	Если СтруктураНастройки = Неопределено Тогда 
		ТекстСообщения = НСтр("ru = 'Для %1 не определены настройки ограничения полей ввода'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступенСписокЗначений Тогда 
		ТекстСообщения = НСтр("ru = 'Для %1 недоступно получение массива значений'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
		
	ОграничениеТипа = СтруктураНастройки.СтруктураСвойствСписка.ОграничениеТипа;
	
	МассивЗначений = Новый Массив;
	Данные = ДополнительныеНастройкиСистемы[ИмяПредопределенного].СписокЗначений; 

	Для Каждого СтрокаДанных Из Данные Цикл 

		Значение = СтрокаДанных.Значение;
		Значение = ОграничениеТипа.ПривестиЗначение(Значение);  

		Если Не ПроверятьЗаполнение
			Или ЗначениеЗаполнено(Значение)
			Или ТипЗнч(Значение) = Тип("Булево") Тогда 
			МассивЗначений.Добавить(Значение);
		Иначе
			ТекстСообщения = НСтр("ru = 'Не заполнено значение элемента списка дополнительной настройки %1'"); 
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;	    
		
	КонецЦикла;	
	
	Если ПроверятьЗаполнение
		И Не ЗначениеЗаполнено(МассивЗначений) Тогда 
		ТекстСообщения = НСтр("ru = 'Не заполнен список значений дополнительной настройки %1'"); 
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;                       
	КонецЕсли;	
	
	Возврат МассивЗначений;
	
КонецФункции // >> 11.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-723

// << 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
// Получает значение дополнительной настройки системы из хранилища значения
// Значение настройки будет приведено к типу в соответствии с настройкой ограничения типа
//
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента справочника доп. настроек
//  ПроверятьЗаполнение  - Булево - Флаг проверки заполнения значения настройки.
//						   По умолчанию = Истина: при незаполненном значении будет вызвано исключение
//
// Возвращаемое значение:
//  Произвольный - значение настройки, приведенное к типу
//
Функция ЗначениеИзХранилищаЗначения(ИмяПредопределенного, ПроверятьЗаполнение = Истина) Экспорт
	
	ДополнительныеНастройкиСистемы = Справочники.КР_ДополнительныеНастройкиСистемы;
	СтруктураНастройки =
		ДополнительныеНастройкиСистемы.ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяПредопределенного);
	
	Если СтруктураНастройки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" не определены настройки ограничения полей ввода'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступноЗначение Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" недоступно получение значения'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОграничениеТипа = СтруктураНастройки.СтруктураСвойствЗначения.ОграничениеТипа;
	
	Значение = ДополнительныеНастройкиСистемы[ИмяПредопределенного].ЗначениеВХранилище.Получить();
	Значение = ОграничениеТипа.ПривестиЗначение(Значение);
	
	Если ПроверятьЗаполнение И Не ЗначениеЗаполнено(Значение) И Не ТипЗнч(Значение) = Тип("Булево") Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнено значение в хранилище дополнительной настройки ""%1""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции // >> 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970

// << 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970
// Получает массив значений дополнительной настройки системы из хранилища значения
// Значения настройки будут приведены к типу в соответствии с настройкой ограничения типа
//
// Параметры:
//  ИмяПредопределенного - Строка - Имя предопределенного элемента справочника доп. настроек
//  ПроверятьЗаполнение  - Булево - Флаг проверки заполнения значения настройки.
//						   По умолчанию = Истина: при незаполненном значении будет вызвано исключение
//
// Возвращаемое значение:
//  Массив - Массив значений настройки, приведенных к типу
//
Функция МассивЗначенийИзХранилищаЗначений(ИмяПредопределенного, ПроверятьЗаполнение = Истина) Экспорт
	
	ДополнительныеНастройкиСистемы = Справочники.КР_ДополнительныеНастройкиСистемы;
	СтруктураНастройки =
		ДополнительныеНастройкиСистемы.ПолучитьОграничениеПолейФормыПредопределенногоЭлемента(ИмяПредопределенного);
	
	Если СтруктураНастройки = Неопределено Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" не определены настройки ограничения полей ввода'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	ИначеЕсли Не СтруктураНастройки.ДоступенСписокЗначений Тогда
		ТекстСообщения = НСтр("ru = 'Для ""%1"" недоступно получение массива значений'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОграничениеТипа = СтруктураНастройки.СтруктураСвойствСписка.ОграничениеТипа;
	
	МассивЗначений = Новый Массив;
	Данные = ДополнительныеНастройкиСистемы[ИмяПредопределенного].СписокЗначений;
	
	Для Каждого СтрокаДанных Из Данные Цикл
		Значение = СтрокаДанных.ЗначениеВХранилище.Получить();
		Значение = ОграничениеТипа.ПривестиЗначение(Значение);
		
		Если ПроверятьЗаполнение И Не ЗначениеЗаполнено(Значение) И Не ТипЗнч(Значение) = Тип("Булево") Тогда
			ТекстСообщения = НСтр("ru = 'Не заполнено значение в хранилище элемента списка дополнительной настройки ""%1""'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
			ВызватьИсключение ТекстСообщения;
		Иначе
			МассивЗначений.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
	Если ПроверятьЗаполнение И Не МассивЗначений.Количество() Тогда
		ТекстСообщения = НСтр("ru = 'Не заполнен список значений в хранилище дополнительной настройки ""%1""'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяПредопределенного);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	Возврат МассивЗначений;
	
КонецФункции // >> 28.12.2022 Маскаев П.Ю., КРОК, JIRA№ A2105505-970

// Создан: 23.08.2022, Мельников А.А., КРОК
// Получение кэшированных значений доп настроек.
// Параметры: 
// Настройка - СправочникСсылка.КР_ДополнительныеНастройкиСистемы - Та настройка, для которой надо получить значение
// Возвращаемое значение: 
// Структура - Значения справочника ДопНастройки в структуре
//				"Значение, ЗначениеВХранилище, СписокЗначенийБ"	
//							где список значений массив из структур "Значение, ЗначениеВХранилище" 
// 
Функция ПолучитьЗначениеДополнительнойНастройки(Настройка) Экспорт

	ШаблонРезультата = Новый Структура("Значение, ЗначениеВХранилище, СписокЗначений", , , Новый Массив);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КР_ДополнительныеНастройкиСистемы.Значение КАК Значение,
		|	КР_ДополнительныеНастройкиСистемы.ЗначениеВХранилище КАК ЗначениеВХранилище
		|ИЗ
		|	Справочник.КР_ДополнительныеНастройкиСистемы КАК КР_ДополнительныеНастройкиСистемы
		|ГДЕ
		|	КР_ДополнительныеНастройкиСистемы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КР_ДополнительныеНастройкиСистемыСписокЗначений.Значение КАК Значение,
		|	КР_ДополнительныеНастройкиСистемыСписокЗначений.ЗначениеВХранилище КАК ЗначениеВХранилище
		|ИЗ
		|	Справочник.КР_ДополнительныеНастройкиСистемы.СписокЗначений КАК КР_ДополнительныеНастройкиСистемыСписокЗначений
		|ГДЕ
		|	КР_ДополнительныеНастройкиСистемыСписокЗначений.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	РезультатЗапросаПакет = Запрос.ВыполнитьПакет();
	
	Если Не РезультатЗапросаПакет[0].Пустой() Тогда
		ВыборкаДетальныеЗаписи = РезультатЗапросаПакет[0].Выбрать();  		
		ВыборкаДетальныеЗаписи.Следующий();    
		ЗаполнитьЗначенияСвойств(ШаблонРезультата, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	СписокЗначений = Новый Массив;
	Если Не РезультатЗапросаПакет[1].Пустой() Тогда		
		ВыборкаДетальныеЗаписи = РезультатЗапросаПакет[0].Выбрать();  		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ЗначениеВСписке = Новый Структура("Значение, ЗначениеВХранилище");	
			ЗаполнитьЗначенияСвойств(ЗначениеВСписке, ВыборкаДетальныеЗаписи);  
			СписокЗначений.Добавить(ЗначениеВСписке);
		КонецЦикла;
	КонецЕсли;
	 
	ШаблонРезультата.СписокЗначений = Новый ФиксированныйМассив(СписокЗначений);
	
	Возврат Новый ФиксированнаяСтруктура(ШаблонРезультата);
	
КонецФункции  // Создан: 23.08.2022, Мельников А.А., КРОК     
      
#Область ПредопределенныеЗначенияНастроек

// Создан: 23.08.2022, Мельников А.А., КРОК 
// Получает контрагента из предопределенной настройки Ozon
// Возвращаемое значение: 
// СправочникСсылка.Контрагенты
//
Функция КонтрагентOzon() Экспорт
		
	ЗначениеНастройки = ПолучитьЗначениеДополнительнойНастройки(Справочники.КР_ДополнительныеНастройкиСистемы.Ozon);
	
	Если ЗначениеНастройки <> Неопределено Тогда 
		Возврат ЗначениеНастройки.Значение;
	КонецЕсли; 
	
	Возврат Неопределено;
	
КонецФункции  // Создан: 23.08.2022, Мельников А.А., КРОК       

// Создан: 23.08.2022, Мельников А.А., КРОК 
// Получает контрагента из предопределенной настройки WB
// Возвращаемое значение: 
// СправочникСсылка.Контрагенты
//
Функция КонтрагентWB() Экспорт
	
	ЗначениеНастройки = ПолучитьЗначениеДополнительнойНастройки(Справочники.КР_ДополнительныеНастройкиСистемы.WB);
	Если ЗначениеНастройки <> Неопределено Тогда 
		Возврат ЗначениеНастройки.Значение;
	КонецЕсли; 
	
	Возврат Неопределено;  
	
КонецФункции // Создан: 23.08.2022, Мельников А.А., КРОК

// << 02.11.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-772
Функция СкладEsolutions() Экспорт
	
	СкладEsolutions = Справочники.КР_ДополнительныеНастройкиСистемы.СкладEsolutions;
	ЗначениеНастройки = ПолучитьЗначениеДополнительнойНастройки(СкладEsolutions);
	Если Не ЗначениеНастройки = Неопределено Тогда
		Возврат ЗначениеНастройки.Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // >> 02.11.2022, Маскаев П.Ю., КРОК, Jira№ A2105505-772

#КонецОбласти
  
#Область ОбменСМагазинами

// << 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
Функция БазаЯвляетсяЦентральной() Экспорт 
		
	Возврат Константы.КР_БазаЯвляетсяЦентральной.Получить(); 
	
КонецФункции // >> 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 09.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1241
Функция МассивМаршрутизацийКТекущейБазеДанных() Экспорт 

	МассивСкладовТекущейБазы = КР_ДополнительныеНастройкиПовтИсп.МассивЗначений("СкладыТекущейБазыДанных", Ложь);
	
	МассивМаршрутизаций = Новый Массив;
    ЗначенияРеквизита = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(МассивСкладовТекущейБазы, "КР_НомерМагазина");
	
	Для Каждого КлючЗначение Из ЗначенияРеквизита Цикл 
		
		НомерМагазина = КлючЗначение.Значение;		
		МассивМаршрутизаций.Добавить(XMLСтрока(НомерМагазина));
		
	КонецЦикла;	
	
	Возврат МассивМаршрутизаций;
	
КонецФункции // >> 09.03.2023 Марченко С.Н., КРОК, JIRA№A2105505-1241

// << 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
Функция ПолучитьНастройкиОтсечениеДвиженийПоСкладам(РегистраторПолноеИмя, РегистрПолноеИмя) Экспорт 
		
	БазаЯвляетсяЦентральной = КР_ДополнительныеНастройкиПовтИсп.БазаЯвляетсяЦентральной(); 
	Если БазаЯвляетсяЦентральной                 
		// Вызываем извне, чтоб закэшировать значения
		Или Не КР_ДополнительныеНастройкиПовтИсп.ТребуетсяОтсечениеДвиженийПоРегистратору(РегистраторПолноеИмя) Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	Если РегистрПолноеИмя = "РегистрНакопления.СебестоимостьТоваров"
		Или РегистрПолноеИмя = "РегистрНакопления.ТоварыОрганизаций" 
		Тогда 
		
		ПутьКОтборуПоСкладу = "Т.АналитикаУчетаНоменклатуры.СкладскаяТерритория";
		
	ИначеЕсли РегистрПолноеИмя = "РегистрНакопления.ТоварыКОтбору" 
		Тогда 
		
		ПутьКОтборуПоСкладу = "ВЫРАЗИТЬ(Т.Распоряжение КАК Документ.ЗаказНаПеремещение).СкладОтправитель";
		
	Иначе

		ПутьКОтборуПоСкладу = "Т.Склад";

	КонецЕсли;	
	
	// Вызываем извне, чтоб закэшировать значения
	МассивСкладов = КР_ДополнительныеНастройкиПовтИсп.МассивЗначений("СкладыТекущейБазыДанных");
	Если Не ЗначениеЗаполнено(МассивСкладов) Тогда 
		ВызватьИсключение НСтр("ru = 'В режиме работы информационной базы в качестве периферийной базы "
		 	+ "(константа ""База является центральной"" = Ложь) должнен быть заполнен список складов текущей базы "
			+ "данных (доп.настройки ""Склады текущей базы данных"")'"
		);
	КонецЕсли;
	
	Настройки = Новый Структура;
	Настройки.Вставить("ПутьКОтборуПоСкладу", ПутьКОтборуПоСкладу);
	Настройки.Вставить("МассивСкладов", МассивСкладов);

	Возврат Настройки;
	
КонецФункции // >> 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751
Функция ТребуетсяОтсечениеДвиженийПоРегистратору(ДокументПолноеИмя) Экспорт  
	
	ИндексированныйСписок = Новый Соответствие;
	ИндексированныйСписок.Вставить("Документ.ЗаказНаПеремещение", Истина); 
	ИндексированныйСписок.Вставить("Документ.ПеремещениеТоваров", Истина); 
	ИндексированныйСписок.Вставить("Документ.УпаковочныйЛист", Истина); 
	ИндексированныйСписок.Вставить("Документ.АктОРасхожденияхПослеПеремещения", Истина);
	
	Возврат (ИндексированныйСписок[ДокументПолноеИмя] <> Неопределено);
	
КонецФункции // >> 10.11.2022 Марченко С.Н., КРОК, JIRA№A2105505-751

// << 26.10.2023 Фомичев А.Е
// << 08.11.2023 Петухов А.В., Фактор, #3330
//Функция ИспользоватьСжатиеСообщений() Экспорт 
//		
//	Возврат Константы.КР_ИспользоватьСжатиеСообщений.Получить(); 
//	
//КонецФункции 
Функция ИспользоватьСжатиеСообщений(ТочкаОбмена) Экспорт 
	
	мсвТочки = СтрРазделить(Константы.злТочкиОбменаСоСжатиемСообщений.Получить(),",",Ложь);
	Возврат мсвТочки.Найти(ТочкаОбмена)<>Неопределено;
	
КонецФункции 

// >> 08.11.2023 Петухов А.В., Фактор, #3330

Функция ОбъектыИнтеграцииСИндивидуальнойОчередьюОбработки() Экспорт 
		
	Возврат Константы.КР_ОбъектыИнтеграцииСИндивидуальнойОчередьюОбработки.Получить(); 
	
КонецФункции 
// >> 26.10.2023 Фомичев А.Е

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
